[
  {
    "title": "Building a Hotel Booking System with Directus, Next.js, and Stripe",
    "description": "Learn how to build an hotel booking website with availability, billing with Stripe, and Directus as a backend.",
    "link": "https://docs.directus.io/blog/building-a-hotel-booking-system-with-directus-next-js-and-stripe.html",
    "date": "Apr 2, 2024"
  },
  {
    "title": "Deploying Directus to Google Cloud Platform with Docker",
    "description": "Learn how to run your self-hosted Directus instance on the Google Cloud Run and connect it with a Cloud SQL database (PostgreSQL) and Cloud Storage for storing assets.",
    "link": "https://docs.directus.io/blog/deploying-directus-to-google-cloud-platform-with-docker.html",
    "date": "Mar 29, 2024"
  },
  {
    "title": "What is cross-browser compatibility, and why should you care?",
    "description": "This article discusses cross-browser compatibility and its significance, methods to ensure compatibility, and practical tips for ensuring cross-browser compatibility in your websites.",
    "link": "https://blog.jamiin.com/what-is-cross-browser-compatibility-and-why-should-you-care",
    "date": "Mar 29, 2024"
  },
  {
    "title": "How to build a news aggregator with Next.js, Resend, and Apify",
    "description": "In this tutorial, you’ll learn how to build a web scraper that scrapes articles daily from 4 different platforms, displays the results in a Next.js application, and sends daily updates on the latest articles to subscribers' email addresses using Resend.com",
    "link": "https://blog.apify.com/how-to-build-a-news-aggregator/",
    "date": "Mar 27, 2024"
  },
  {
    "title": "Getting Started with Directus and Remix",
    "description": "Let's learn how to build a blog using Directus as a CMS. You will store, retrieve, and use global metadata such as the site title, create new pages dynamically based on Directus items.",
    "link": "https://docs.directus.io/blog/getting-started-with-directus-and-remix.html",
    "date": "Jan 29, 2024"
  },
  {
    "title": "Deploying Directus to AWS EC2 with Docker",
    "description": "In this tutorial, you will learn how to deploy a self-hosted instance of Directus to Amazon Web Services (AWS) EC2, connect it to an AWS RDS PostgreSQL database and S3 storage bucket.",
    "link": "https://docs.directus.io/blog/deploying-directus-to-aws-ec2-with-docker.html",
    "date": "Jan 26, 2024"
  },
  {
    "title": "Getting Started with Directus and Astro",
    "description": "A starter guide on how to build a website using Astro framework and Directus as a headless CMS.",
    "link": "https://docs.directus.io/blog/getting-started-directus-astro.html",
    "date": "Jan 17, 2024"
  },
  {
    "title": "Using Directus Auth with NextAuth.js",
    "description": "Learn how to build an authentication system in a Next.js application using NextAuth.js and Directus Auth.",
    "link": "https://docs.directus.io/blog/directus-auth-nextauth.html",
    "date": "Jan 10, 2024"
  },
  {
    "title": "TypeScript utility types: when and how to use them",
    "description": "Learn about utility types in TypeScript, when and how to use them, and how you can combine them with custom types.",
    "link": "https://blog.apify.com/typescript-utility-types/",
    "date": "Nov 3, 2023"
  },
  {
    "title": "Serverless web scraping with TypeScript and AWS Lambda",
    "description": "Learn how to perform web scraping on any website using AWS Lambda services and deploy your scrapers to AWS.",
    "link": "https://blog.apify.com/web-scraping-with-typescript-and-aws-lambda/",
    "date": "Sep 13, 2023"
  },
  {
    "title": "Improving Your Workflow as a Developer with Bash Aliases",
    "description": "This article explores what bash aliases are and how you can use them to enhance your development process.",
    "link": "https://blog.jamiin.com/improving-your-workflow-as-a-developer-with-bash-aliases",
    "date": "Aug 5, 2023"
  },
  {
    "title": "Mastering Generics in Typescript",
    "description": "Explore the fundamentals of generics, delve into some of its concepts, and learn with practical examples to become a better user of generics in TypeScript.",
    "link": "https://blog.jamiin.com/mastering-generics-in-typescript",
    "date": "Jul 14, 2023"
  },
  {
    "title": "The Differences Between Type and Interface in Typescript",
    "description": "This article explains the differences between types and interfaces, covering syntax, declaration, and implementation disparities. It provides insights into scenarios favoring each, including when to use 'type' for primitive types and when interfaces excel in extension and declaration merging",
    "link": "https://blog.jamiin.com/the-differences-between-type-and-interface-in-typescript",
    "date": "Jun 13, 2023"
  },
  {
    "title": "How to Send Custom Emails from Netlify: A Step-by-Step Guide",
    "description": "This article explains how to send custom emails from shared hosting while your site is hosted on Netlify.",
    "link": "https://blog.jamiin.com/how-to-send-custom-emails-from-netlify-a-step-by-step-guide",
    "date": "May 29, 2023"
  },
  {
    "title": "Effectiveness of Developer Relations Programs: A Study of MongoDB, AWS, and Vercel",
    "description": "In my #90DaysofDevRel challenge, I delved into MongoDB, AWS, and Vercel's developer relations. From MongoDB's community focus to AWS's global impact and Vercel's active engagement, each company prioritizes strong customer relationships.",
    "link": "https://blog.jamiin.com/effectiveness-of-developer-relations-programs-a-study-of-mongodb-aws-and-vercel",
    "date": "May 4, 2023"
  },
  {
    "title": "How to Contribute to Community Leaders Cm-Tools Repository!",
    "description": "Learn how to contribute to open-source as a community manager",
    "link": "https://www.communityleads.africa/blog/how-to-contribute-to-community-leaders-cm-tools-repository",
    "date": "Feb 5, 2023"
  }
]